#include <iostream>

using namespace std;

int main() {
    int N;
    cout << "Введіть розмір масиву N: ";
    cin >> N;

    int A[N];

    // Заповнюємо масив A випадковими значеннями
    for (int i = 0; i < N; i++) {
        A[i] = rand() % 100; // Заповнюємо масив випадковими цілими числами від 0 до 99
    }

    // Виводимо початковий масив
    cout << "Початковий масив A: ";
    for (int i = 0; i < N; i++) {
        cout << A[i] << " ";
    }
    cout << endl;

    // Перше половину масиву помножимо на 2, а другу половину - на 3
    for (int i = 0; i < N; i++) {
        if (i < N / 2) {
            A[i] *= 2;
        } else {
            A[i] *= 3;
        }
    }

    // Виводимо змінений масив
    cout << "Змінений масив A: ";
    for (int i = 0; i < N; i++) {
        cout << A[i] << " ";
    }

    return 0;
}
